import { Box, Icon, Paper, Typography } from "@mui/material";
import { BsInfoCircleFill } from "react-icons/bs";
import TosSection from "./_components/TosSection";

const TosPage = () => {
	return (
		<div className="flex flex-col w-full items-center gap-10 md:p-10 p-5">
			<Typography variant="h4" className="flex gap-5 items-center">
				<Icon color="info">
					<BsInfoCircleFill />
				</Icon>
				{"قوانین و مقررات ارائه خدمات طراحی وب اپلیکیشن با کمانگیر"}
			</Typography>
			<Box
				component={Paper}
				className="flex flex-col md:w-1/2 w-full gap-10 p-5"
			>
				<TosSection
					title="مقدمه"
					caption="این سند به منزله یک قرارداد رسمی و لازم‌الاجرا فی‌مابین آرش قنبری (که از این پس «سرویس‌دهنده» نامیده می‌شود) و هر شخص حقیقی یا حقوقی که از خدمات ما استفاده می‌کند (که از این پس «کارفرما» یا «مشتری» نامیده می‌شود) می‌باشد. ثبت سفارش و پرداخت هزینه هر یک از پلن‌ها یا پروژه‌های اختصاصی، به منزله مطالعه دقیق، درک کامل و پذیرش کلیه مفاد این سند است."
				/>
				<TosSection
					caption={`•	سرویس‌دهنده: آرش قنبری که مسئولیت طراحی، توسعه و راه‌اندازی پروژه را بر عهده دارد.

•	کارفرما: شخص حقیقی یا حقوقی که سفارش پروژه را ثبت کرده است.

•	پروژه: وب‌اپلیکیشن یا وب‌سایتی که بر اساس ویژگی‌های پلن انتخابی یا توافقات پروژه اختصاصی، توسط سرویس‌دهنده توسعه داده می‌شود.

•	پلن: بسته‌های خدماتی از پیش تعریف‌شده در وب‌سایت که هر کدام دارای ویژگی‌ها، امکانات و هزینه مشخصی هستند.

•	سورس کد: مجموعه فایل‌های برنامه‌نویسی و کدهای منبع که اساس و منطق نرم‌افزاری پروژه را تشکیل می‌دهند.
`}
					title="ماده ۱: تعاریف"
				/>
				<TosSection
					caption={`•	اجرای پروژه منوط به پرداخت کامل هزینه (۱۰۰٪) مشخص‌شده در پلن یا پیش‌فاکتور پروژه اختصاصی می‌باشد.
				
 •	در صورتی که کارفرما نیاز به امکاناتی فراتر از پلن‌های موجود داشته باشد، می‌تواند از طریق بخش «سفارش پروژه اختصاصی» یا تماس با پشتیبانی، درخواست خود را ثبت نماید.
 
 •	هزینه این نوع پروژه‌ها پس از بررسی، برآورد شده و به کارفرما اعلام می‌گردد.

 •	 وظیفه تهیه مستندات و داکیومنت‌سازی نیازمندی‌ها (Requirements)  در پروژه‌های اختصاصی، به طور کامل بر عهده کارفرما می‌باشد و باید به صورت شفاف و مکتوب به سرویس‌دهنده تحویل داده شود.
`}
					title="ماده ۲: شرایط ثبت سفارش و پرداخت"
				/>
				<TosSection
					caption={`•	کارفرما موظف است کلیه اطلاعات هویتی و تماس خود را به‌طور دقیق ارائه نماید.

•	خریداری دامنه (Domain) به طور کامل بر عهده کارفرما بوده و پس از خرید، اطلاعات آن باید جهت اتصال به هاست، در اختیار سرویس‌دهنده قرار گیرد.

•	در صورتی که کارفرما تمایل به استفاده از هاستینگ شخصی داشته باشد، موظف است آن را شخصاً خریداری کرده و کلیه اطلاعات دسترسی به هاست را جهت راه‌اندازی پروژه به سرویس‌دهنده تحویل دهد.

•	در صورت نیاز پروژه به درگاه پرداخت یا نماد اعتماد الکترونیک (اینماد)، کارفرما موظف است کلیه اطلاعات و مدارک هویتی مورد نیاز را جهت ثبت‌نام و انجام مراحل اداری، در اختیار سرویس‌دهنده قرار دهد. 

•	کارفرما مسئولیت کامل قانونی بودن و صحت محتوای ارائه‌شده (متن، تصویر و...) را بر عهده دارد و متعهد می‌شود که محتوای وی مغایر با قوانین کشور نباشد.
`}
					title="ماده ۳: تعهدات کارفرما"
				/>
				<TosSection
					caption={`•	سرویس‌دهنده متعهد به توسعه و تحویل پروژه بر اساس ویژگی‌های پلن انتخابی یا توافقات پروژه اختصاصی می‌باشد و تضمین کدنویسی تمیز با تکنولوژی‌های ذکر شده را ارائه می‌دهد.

•	راه‌اندازی و تهیه هاست برای پروژه به صورت پیش‌فرض بر عهده سرویس‌دهنده می‌باشد. کلیه هاست‌های تهیه‌شده توسط سرویس‌دهنده، در دیتا سنترهای ایران میزبانی می‌شوند تا در زمان محدودیت‌های اینترنت سراسری نیز در دسترس باقی بمانند. 

•	سرویس‌دهنده موظف است در صورت نیاز کارفرما، فرآیند درخواست درگاه پرداخت و اینماد را با استفاده از مدارک ارائه‌شده توسط کارفرما پیگیری نماید.

•	سرویس‌دهنده متعهد به حفظ محرمانگی کلیه اطلاعات و اسناد کارفرما می‌باشد.
`}
					title="ماده ۴: تعهدات سرویس‌دهنده"
				/>
				<TosSection
					caption={`•	در حالت عادی و برای کلیه پلن‌های تجاری (فروشگاهی، شرکتی و غیره)، سورس کد پروژه به کارفرما تحویل داده نمی‌شود و صرفاً نسخه نهایی و قابل اجرای پروژه بر روی هاست راه‌اندازی می‌گردد.

•	تحویل سورس کد، تنها و انحصاراً برای پلن‌های دانشجویی و پروژه‌های پایان‌نامه انجام می‌شود. 

•	در صورتی که کارفرما در سایر پلن‌ها اصرار بر دریافت سورس کد داشته باشد، باید هزینه اضافی معادل ۱۰۰٪ هزینه کل پروژه را پرداخت نماید (به عنوان مثال، اگر هزینه پروژه ۵۰ میلیون تومان باشد، هزینه نهایی برای دریافت سورس کد، ۱۰۰ میلیون تومان خواهد بود).

•	نکته بسیار مهم: به محض تحویل سورس کد به کارفرما، کلیه تعهدات سرویس‌دهنده از جمله گارانتی فنی و پشتیبانی به طور کامل باطل می‌گردد و مسئولیت نگهداری و توسعه آتی کد بر عهده کارفرما خواهد بود.
`}
					title="ماده ۵: تحویل سورس کد (بسیار مهم)"
				/>
				<TosSection
					caption={`•	کارفرما پس از پرداخت هزینه، تنها به مدت ۳ روز (۷۲ ساعت) فرصت دارد تا در صورت انصراف از ادامه پروژه، درخواست لغو سفارش خود را از طریق تماس با پشتیبانی به ثبت برساند.

•	در صورت ثبت درخواست لغو در بازه زمانی مجاز، مبلغ پرداختی کارفرما پس از کسر هزینه هاست (که در ابتدای کار برای پروژه خریداری شده است)، به کیف پول کاربری ایشان در داخل وب‌سایت بازگردانده می‌شود.

•	کارفرما می‌تواند از موجودی کیف پول خود برای خرید هرگونه پلن، محصول یا خدمات دیگری که در وب‌سایت ارائه می‌شود، استفاده نماید.

•	پس از گذشت ۳ روز از زمان پرداخت، سفارش به هیچ عنوان قابل لغو نبوده و در صورت انصراف کارفرما، هیچ مبلغی به کیف پول یا حساب بانکی ایشان عودت داده نخواهد شد و پروژه طبق زمان‌بندی، تکمیل و تحویل می‌گردد.
`}
					title="ماده ۶: لغو سفارش و عودت وجه"
				/>
				<TosSection
					caption={`•	کلیه پلن‌ها و پروژه‌ها دارای گارانتی فنی برای یک دوره زمانی مشخص (که در توضیحات هر پلن ذکر شده) می‌باشند. 

•	گارانتی فنی صرفاً شامل رفع ایرادات (Bugs) احتمالی در عملکرد کدهای اصلی پروژه می‌باشد. 

•	افزودن امکانات یا ویژگی‌های جدید جزو گارانتی محسوب نمی‌شود. در صورت نیاز به فیچرهای جدید، کارفرما می‌تواند با پشتیبانی تماس گرفته تا پس از برآورد هزینه و زمان و در صورت توافق طرفین، ویژگی مورد نظر به پروژه اضافه گردد.
`}
					title="ماده ۷: گارانتی فنی و پشتیبانی"
				/>
				<TosSection
					caption="در صورت بروز حوادث غیرمترقبه و خارج از کنترل مانند جنگ، بلایای طبیعی، یا قطعی زیرساخت اینترنت کشور، اجرای تعهدات به حالت تعلیق در می‌آید. اگر پروژه در حین انجام باشد، زمان‌بندی تحویل متوقف شده و پس از بازگشت به شرایط عادی، ادامه روند پروژه از سر گرفته خواهد شد. کارفرما در این شرایط موظف به صبوری می‌باشد."
					title="ماده ۸: شرایط فورس ماژور"
				/>
				<TosSection
					caption={`•	این قرارداد بر اساس قوانین و عرف جاری در کشور تنظیم شده است. 

•	در صورت بروز هرگونه اختلاف، طرفین در ابتدا تلاش خواهند کرد تا مشکل را به صورت دوستانه و مسالمت‌آمیز حل و فصل نمایند.

•	در صورت عدم دستیابی به توافق از طریق مذاکره، موضوع جهت قضاوت و حل مشکل به یک کارشناس فنی مورد تایید دو طرف ارجاع داده خواهد شد. 

•	رأی و نظر کارشناس منتخب برای طرفین قطعی و لازم‌الاجرا می‌باشد و طرفین ملزم به رعایت آن هستند.
`}
					title="ماده ۹: حل اختلاف"
				/>
			</Box>
		</div>
	);
};

export default TosPage;
